In [1]:
import pandas as pd
data = {
    "Name": ["Riya", "Aman", "Riya", "Neha", None],
    "Age" : ["20","21","20",None,"22"],
    "Gender" : ["Female","Male","Female","Female","Male"],
}
df = pd.DataFrame(data)

In [2]:
print(df.head())

   Name   Age  Gender
0  Riya    20  Female
1  Aman    21    Male
2  Riya    20  Female
3  Neha  None  Female
4  None    22    Male

In [3]:
print(df.describe())

        Name Age  Gender
count      4   4       5
unique     3   3       2
top     Riya  20  Female
freq       2   2       3

In [4]:
df.shape

(5, 3)

In [5]:
df.columns

Index(['Name', 'Age', 'Gender'], dtype='object')

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      object
 2   Gender  5 non-null      object
dtypes: object(3)
memory usage: 252.0+ bytes

In [8]:
df.isnull()

    Name    Age  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False   True   False
4   True  False   False

In [9]:
df.isnull().sum()

Name      1
Age       1
Gender    0
dtype: int64

In [15]:
df["Age"].dtype

dtype('O')

In [16]:
df["Age"] = pd.to_numeric(df["Age"], errors="coerce")

In [20]:
df["Age"].fillna(df["Age"].mean())

0    20.00
1    21.00
2    20.00
3    20.75
4    22.00
Name: Age, dtype: float64

In [19]:
df

   Name    Age  Gender
0  Riya  20.00  Female
1  Aman  21.00    Male
2  Riya  20.00  Female
3  Neha  20.75  Female
4  None  22.00    Male

In [22]:
df["Name"].fillna("Jarvis")

0      Riya
1      Aman
2      Riya
3      Neha
4    Jarvis
Name: Name, dtype: object

In [23]:
df.duplicated()

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [27]:
df.drop_duplicates(inplace=True)
df

   Name    Age  Gender
0  Riya  20.00  Female
1  Aman  21.00    Male
3  Neha  20.75  Female
4  None  22.00    Male

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     4 non-null      float64
 2   Gender  4 non-null      object
dtypes: float64(1), object(2)
memory usage: 128.0+ bytes

In [29]:
df=df.dropna(subset=["Name"])

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      float64
 2   Gender  3 non-null      object
dtypes: float64(1), object(2)
memory usage: 96.0+ bytes